## Задача №1:
#
# Джон Макклейн пытается найти этаж на котором заложена бомба и у него есть список инструкций (в файле data/1.txt):
#
# (- Джон должен подняться на этаж выше
# ) - Джон должен опуститься на этаж ниже
#
# Поиск начинается с нулевого этажа. 
#
# На каком этаже находится бомба?
#
## Требования к решению:
# - Входные данные находятся в файле data/1.txt
# - Результат должен быть выведен в консоль командой puts
#
#
## Решение:

file = File.open("data/1.txt")
file_data = file.read

a = 0
i = 0
while i < file_data.size
  if file_data[i] == "("
    a += 1
  elsif file_data[i] == ")"
    a -= 1
  end
  i += 1
end
puts a
